# Data Analysis with Pandas (2nd Part)

**Outline:**

* [Knowing Basic Stats](#Knowing-Basic-Stats)
* [Grouping](#Grouping)
* [Creating Pivot Table](#Creating-Pivot-Table)
  * https://pbpython.com/pandas-pivot-table-explained.html

In [7]:
import pandas as pd

## Knowing Basic Stats

In [15]:
data = {
    'age': [25, 30, 35],
    'savings': [3000, 3100, 1500]
}
df = pd.DataFrame(data=data)

In [16]:
df.describe()

        age      savings
count   3.0     3.000000
mean   30.0  2533.333333
std     5.0   896.288644
min    25.0  1500.000000
25%    27.5  2250.000000
50%    30.0  3000.000000
75%    32.5  3050.000000
max    35.0  3100.000000

In [17]:
df.cov()

            age        savings
age        25.0   -3750.000000
savings -3750.0  803333.333333

In [18]:
df.corr()

              age   savings
age      1.000000 -0.836784
savings -0.836784  1.000000

### Challenges

จาก Series ของค่าไฟปี 2015 โดยแต่ละเดือนมีค่าไฟตามนี้

* January มียอด 3,000 บาท
* February มียอด 3,512 บาท
* March มียอด 1,900 บาท
* April มียอด 1,988 บาท
* May มียอด 3,012 บาท
* June มียอด 2,912.35 บาท
* July มียอด 3,100 บาท
* August มียอด 2,501.02 บาท
* September มียอด 3,309 บาท
* October มียอด 2,087 บาท
* November มียอด 4,223 บาท
* December มียอด 3,566 บาท

Hint: ให้ใช้เดือนเป็น index และยอดเงินเป็นค่าของแต่ละ index

ลองตอบคำถามต่อไปนี้
1. รวมทั้งปีแล้วต้องจ่ายค่าไฟเท่าไหร่? เฉลี่ยเดือนละเท่าไหร่?
2. เดือนไหนจ่ายค่าไฟเยอะสุด?

จาก DataFrame ข้อมูลเงินเดือนของพนักงาน

คนที่ 1

* ชื่อ William
* อาชีพ Chief Investment Officer
* เงินเดือนทั้งปี 507,831.60 USD

คนที่ 2

* ชื่อ Ellen
* อาชีพ Asst Med Examiner
* เงินเดือนทั้งปี 279,311.10 USD

คนที่ 3

* ชื่อ Barbara
* อาชีพ Dept Head
* รายได้ทั้งปี 307,580.34 USD

ลองตอบคำถามต่อไปนี้
1. ใครได้รายได้ต่อปีเยอะที่สุด?
2. ใครได้รายได้ต่อปีต่ำกว่า 300,000 USD บ้าง?

---

## Grouping

In [19]:
adult_data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data'
columns = ['age', 'Work Class', 'fnlwgt', 'education', 'education-num', 'marital-status', 'occupation', 'relationship', 'race', 'sex', 'capital-gain', 'capital-loss', 'hours-per-week', 'native-country', 'Money Per Year']
adult = pd.read_csv(adult_data_url, names=columns)

In [33]:
adult.groupby('education').agg('mean').tail()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
education,,,,,,
HS-grad,38.974479,189538.739739,9.0,576.800114,70.466622,40.575374
Masters,44.049913,179852.362739,14.0,2562.563552,166.719675,43.836332
Preschool,42.764706,235889.372549,1.0,898.392157,66.490196,36.647059
Prof-school,44.746528,185663.706597,15.0,10414.416667,231.203125,47.425347
Some-college,35.756275,188742.922370,10.0,598.824167,71.637087,38.852284

In [34]:
# Same result as above

adult_group = adult.groupby('education')
adult_group.mean().tail()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
education,,,,,,
HS-grad,38.974479,189538.739739,9.0,576.800114,70.466622,40.575374
Masters,44.049913,179852.362739,14.0,2562.563552,166.719675,43.836332
Preschool,42.764706,235889.372549,1.0,898.392157,66.490196,36.647059
Prof-school,44.746528,185663.706597,15.0,10414.416667,231.203125,47.425347
Some-college,35.756275,188742.922370,10.0,598.824167,71.637087,38.852284

In [35]:
adult.groupby(['education', 'sex']).mean().head()

                         age         fnlwgt  education-num  capital-gain  \
education sex
10th       Female  35.447458  187333.010169            6.0    174.901695
           Male    38.346395  201224.846395            6.0    510.771160
11th       Female  30.546296  193806.465278            7.0    128.108796
           Male    33.407806  195580.212651            7.0    265.675639
12th       Female  29.756944  182910.145833            8.0    174.729167

                   capital-loss  hours-per-week
education sex
10th       Female     69.132203       32.111864
           Male       51.164577       39.336991
11th       Female     21.578704       29.821759
           Male       66.650067       36.312248
12th       Female     11.951389       31.791667

In [ ]:
adult.groupby(['education', 'sex']).mean().head(30)

In [38]:
adult.columns = adult.columns.str.lower().str.replace(' ', '-')
adult[['capital-gain', 'capital-loss', 'money-per-year']].groupby('money-per-year').mean()

                capital-gain  capital-loss
money-per-year
 <=50K            148.752468     53.142921
 >50K            4006.142456    195.001530

---

## Creating Pivot Table

ลองเล่นข้อมูล Sales Funnel จาก [Practical Business Python](https://pbpython.com/)

In [26]:
df = pd.read_excel('data/sales-funnel.xlsx')

In [27]:
df.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [30]:
pd.pivot_table(df, index=['Name'])

                              Account   Price  Quantity
Name
Barton LLC                     740150   35000  1.000000
Fritsch, Russel and Anderson   737550   35000  1.000000
Herman LLC                     141962   65000  2.000000
Jerde-Hilpert                  412290    5000  2.000000
Kassulke, Ondricka and Metz    307599    7000  3.000000
Keeling LLC                    688981  100000  5.000000
Kiehn-Spinka                   146832   65000  2.000000
Koepp Ltd                      729833   35000  2.000000
Kulas Inc                      218895   25000  1.500000
Purdy-Kunde                    163416   30000  1.000000
Stokes LLC                     239344    7500  1.000000
Trantow-Barrows                714466   15000  1.333333

In [31]:
pd.pivot_table(df, index=['Name', 'Product'])

                                          Account   Price  Quantity
Name                         Product
Barton LLC                   CPU           740150   35000         1
Fritsch, Russel and Anderson CPU           737550   35000         1
Herman LLC                   CPU           141962   65000         2
Jerde-Hilpert                Maintenance   412290    5000         2
Kassulke, Ondricka and Metz  Maintenance   307599    7000         3
Keeling LLC                  CPU           688981  100000         5
Kiehn-Spinka                 CPU           146832   65000         2
Koepp Ltd                    CPU           729833   65000         2
                             Monitor       729833    5000         2
Kulas Inc                    CPU           218895   40000         2
                             Software      218895   10000         1
Purdy-Kunde                  CPU           163416   30000         1
Stokes LLC                   Maintenance   239344    5000         1
                             Software      239344   10000         1
Trantow-Barrows              CPU           714466   30000         1
                             Maintenance   714466    5000         2
                             Software      714466   10000         1

In [36]:
pd.pivot_table(df, index=['Name', 'Product'], values=['Quantity'])

                                          Quantity
Name                         Product
Barton LLC                   CPU                 1
Fritsch, Russel and Anderson CPU                 1
Herman LLC                   CPU                 2
Jerde-Hilpert                Maintenance         2
Kassulke, Ondricka and Metz  Maintenance         3
Keeling LLC                  CPU                 5
Kiehn-Spinka                 CPU                 2
Koepp Ltd                    CPU                 2
                             Monitor             2
Kulas Inc                    CPU                 2
                             Software            1
Purdy-Kunde                  CPU                 1
Stokes LLC                   Maintenance         1
                             Software            1
Trantow-Barrows              CPU                 1
                             Maintenance         2
                             Software            1

In [45]:
import numpy as np

In [56]:
pd.pivot_table(df, index=['Product'], values=['Price'], aggfunc=[np.sum, np.mean])

                sum          mean
              Price         Price
Product
CPU          465000  51666.666667
Maintenance   22000   5500.000000
Monitor        5000   5000.000000
Software      30000  10000.000000

In [54]:
pd.pivot_table(df, index=['Name', 'Product'], columns=['Status'], values=['Price'])

                                            Price
Status                                   declined  pending presented       won
Name                         Product
Barton LLC                   CPU          35000.0      NaN       NaN       NaN
Fritsch, Russel and Anderson CPU          35000.0      NaN       NaN       NaN
Herman LLC                   CPU              NaN      NaN       NaN   65000.0
Jerde-Hilpert                Maintenance      NaN   5000.0       NaN       NaN
Kassulke, Ondricka and Metz  Maintenance      NaN      NaN       NaN    7000.0
Keeling LLC                  CPU              NaN      NaN       NaN  100000.0
Kiehn-Spinka                 CPU              NaN      NaN       NaN   65000.0
Koepp Ltd                    CPU          65000.0      NaN       NaN       NaN
                             Monitor          NaN      NaN    5000.0       NaN
Kulas Inc                    CPU              NaN  40000.0       NaN       NaN
                             Software         NaN      NaN   10000.0       NaN
Purdy-Kunde                  CPU              NaN      NaN   30000.0       NaN
Stokes LLC                   Maintenance      NaN   5000.0       NaN       NaN
                             Software         NaN      NaN   10000.0       NaN
Trantow-Barrows              CPU              NaN      NaN   30000.0       NaN
                             Maintenance      NaN   5000.0       NaN       NaN
                             Software         NaN      NaN   10000.0       NaN

In [55]:
pd.pivot_table(df, index=['Name', 'Product'], columns=['Status'], values=['Price'], fill_value=0)

                                            Price
Status                                   declined pending presented     won
Name                         Product
Barton LLC                   CPU            35000       0         0       0
Fritsch, Russel and Anderson CPU            35000       0         0       0
Herman LLC                   CPU                0       0         0   65000
Jerde-Hilpert                Maintenance        0    5000         0       0
Kassulke, Ondricka and Metz  Maintenance        0       0         0    7000
Keeling LLC                  CPU                0       0         0  100000
Kiehn-Spinka                 CPU                0       0         0   65000
Koepp Ltd                    CPU            65000       0         0       0
                             Monitor            0       0      5000       0
Kulas Inc                    CPU                0   40000         0       0
                             Software           0       0     10000       0
Purdy-Kunde                  CPU                0       0     30000       0
Stokes LLC                   Maintenance        0    5000         0       0
                             Software           0       0     10000       0
Trantow-Barrows              CPU                0       0     30000       0
                             Maintenance        0    5000         0       0
                             Software           0       0     10000       0

In [57]:
pd.pivot_table(df, index=['Name', 'Product'], columns=['Status'], values=['Price'], fill_value=0, margins=True)

                                            Price                            \
Status                                   declined pending presented     won
Name                         Product
Barton LLC                   CPU            35000       0         0       0
Fritsch, Russel and Anderson CPU            35000       0         0       0
Herman LLC                   CPU                0       0         0   65000
Jerde-Hilpert                Maintenance        0    5000         0       0
Kassulke, Ondricka and Metz  Maintenance        0       0         0    7000
Keeling LLC                  CPU                0       0         0  100000
Kiehn-Spinka                 CPU                0       0         0   65000
Koepp Ltd                    CPU            65000       0         0       0
                             Monitor            0       0      5000       0
Kulas Inc                    CPU                0   40000         0       0
                             Software           0       0     10000       0
Purdy-Kunde                  CPU                0       0     30000       0
Stokes LLC                   Maintenance        0    5000         0       0
                             Software           0       0     10000       0
Trantow-Barrows              CPU                0       0     30000       0
                             Maintenance        0    5000         0       0
                             Software           0       0     10000       0
All                                         45000   13750     15833   59250


Status                                       All
Name                         Product
Barton LLC                   CPU           35000
Fritsch, Russel and Anderson CPU           35000
Herman LLC                   CPU           65000
Jerde-Hilpert                Maintenance    5000
Kassulke, Ondricka and Metz  Maintenance    7000
Keeling LLC                  CPU          100000
Kiehn-Spinka                 CPU           65000
Koepp Ltd                    CPU           65000
                             Monitor        5000
Kulas Inc                    CPU           40000
                             Software      10000
Purdy-Kunde                  CPU           30000
Stokes LLC                   Maintenance    5000
                             Software      10000
Trantow-Barrows              CPU           30000
                             Maintenance    5000
                             Software      10000
All                                        30705

In [62]:
pd.pivot_table(df,index=['Manager', 'Status'], 
               columns=['Product'],
               values=['Quantity', 'Price'],
               aggfunc={'Quantity': len, 'Price': [np.sum, np.mean]},
               fill_value=0)

                         Price                                       \
                          mean                                  sum
Product                    CPU Maintenance Monitor Software     CPU
Manager       Status
Debra Henley  declined   35000           0       0        0   70000
              pending    40000        5000       0        0   40000
              presented  30000           0       0    10000   30000
              won        65000           0       0        0   65000
Fred Anderson declined   65000           0       0        0   65000
              pending        0        5000       0        0       0
              presented  30000           0    5000    10000   30000
              won        82500        7000       0        0  165000

                                                     Quantity              \
                                                          len
Product                 Maintenance Monitor Software      CPU Maintenance
Manager       Status
Debra Henley  declined            0       0        0        2           0
              pending         10000       0        0        1           2
              presented           0       0    20000        1           0
              won                 0       0        0        1           0
Fred Anderson declined            0       0        0        1           0
              pending          5000       0        0        0           1
              presented           0    5000    10000        1           0
              won              7000       0        0        2           1



Product                 Monitor Software
Manager       Status
Debra Henley  declined        0        0
              pending         0        0
              presented       0        2
              won             0        0
Fred Anderson declined        0        0
              pending         0        0
              presented       1        1
              won             0        0

---

## Challenges

### Adult

จากข้อมูล [Adult](https://archive.ics.uci.edu/ml/datasets/adult) ลองตอบคำถามต่อไปนี้

In [21]:
adult_data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data'
columns = ['age', 'Work Class', 'fnlwgt', 'education', 'education-num', 'marital-status', 'occupation', 'relationship', 'race', 'sex', 'capital-gain', 'capital-loss', 'hours-per-week', 'native-country', 'Money Per Year']
adult = pd.read_csv(adult_data_url, names=columns)

ในข้อมูลชุดนี้กลุ่มอายุที่มีจำนวนน้อยที่สุดคือกลุ่มอายุเท่าไหร่?

In [22]:
adult.age.value_counts(ascending=True)[0:5]

86    1
87    1
88    3
85    3
83    6
Name: age, dtype: int64

กลุ่มอายุที่มีจำนวนคนมากที่สุดคือกลุ่มอายุเท่าไหร่ และมีกี่คน?

In [25]:
adult.age.value_counts()

36    898
31    888
34    886
23    877
35    876
33    875
28    867
30    861
37    858
25    841
27    835
32    828
38    827
39    816
29    813
41    808
24    798
40    794
26    785
42    780
43    770
22    765
20    753
46    737
45    734
44    724
21    720
19    712
47    708
50    602
     ...
60    312
61    300
62    258
63    230
64    208
65    178
67    151
66    150
68    120
69    108
70     89
71     72
72     67
73     64
74     51
76     46
75     45
90     43
77     29
78     23
80     22
79     22
81     20
82     12
84     10
83      6
85      3
88      3
87      1
86      1
Name: age, Length: 73, dtype: int64

จากกลุ่มอายุที่ได้มาข้างต้น มีเพศชายกี่คน และเพศหญิงกี่คน?

In [23]:
adult[adult.age == adult.age.value_counts().index[0]]['sex'].value_counts()

 Male      611
 Female    287
Name: sex, dtype: int64

### Amazon Review

เลือกข้อมูล Amazon review ที่เป็น 5-core จาก http://jmcauley.ucsd.edu/data/amazon/ ของ Julian McAuley

```
reviewerID - ID of the reviewer, e.g. A2SUAM1J3GNN3B
asin - ID of the product, e.g. 0000013714
reviewerName - name of the reviewer
helpful - helpfulness rating of the review, e.g. 2/3
reviewText - text of the review
overall - rating of the product
summary - summary of the review
unixReviewTime - time of the review (unix time)
reviewTime - time of the review (raw)
```

**หมายเหตุ:** ข้อมูลนี้ใช้ทางด้านการวิจัยเท่านั้น :)

เก็บข้อมูล quarter ของแต่ละ review ในคอลัมภ์ใหม่ชื่อ quarter

เลือกข้อมูลที่มี overall rating 5 เฉพาะวันจันทร์ และมีคำว่า love ใน review

หาสินค้าที่มีคนรีวีวในวันที่มีคนรีวีวมากที่สุด

หารีวีวของสินค้า 3 อันดับแรกที่มีคนรีวีวมากที่สุด

หาค่า rating เฉลี่ยของแต่ละสินค้า

หาค่า rating ของผู้ใช้แต่ละคน

หาค่า rating เฉลี่ยของแต่ละวันใน 1 อาทิตย์

หาค่า standard deviation ของ rating ของแต่ละสินค้า

กราฟแสดงจำนวนคนที่มารีวีว

กราฟเปรียบเทียบค่า rating เฉลี่ยในแต่ละวันของอาทิตย์ระหว่างปี 2013 และ 2014

กราฟเปรียบเทียบจำนวนรีวีวต่อวันของเดือนระหว่างปี 2012, 2013 และ 2014